Repository: MustafaBeratYavas/PLANT-DISEASE-EARLY-DIAGNOSIS-SYSTEM
Catalog: mobile/lib/core/l10n/app_*.arb
Languages: tr

# farmerGreetingTitle
source: Hello! I'm GreenHealer.
tr: Merhaba! Ben GreenHealer.

# farmerGreetingBody
source: I am your AI assistant developed for plants. Is there a problem with your plant? Take a photo of the leaf, let's check its health status.
tr: Bitkilerin için geliştirilmiş yapay asistanınım. Bitkinde bir sorun mu var? Yaprağın fotoğrafını çek, sağlık durumunu kontrol edelim.

# farmerAnalyzingBody
source: Interesting... I'm examining the details on the leaves. I'm about to make my diagnosis, almost there.
tr: İlginç... Yapraklardaki detayları inceliyorum. Teşhisimi koymak üzereyim, çok az kaldı.

# farmerResultSuccess
source: Analysis complete! There is a {confidence}% chance this is a {label} case. I have noted treatment methods and detailed information in the library for you, I recommend taking a look.
tr: Analizim bitti! %{confidence} ihtimalle bu bir {label} vakası. Tedavi yöntemlerini ve detaylı bilgileri senin için kütüphaneye not ettim, oraya bir göz atmanı öneririm.

# farmerResultHealthy
source: Great news! There is a {confidence}% chance your plant looks healthy. I didn't find any signs of disease, you're doing a great job; keep up the good care!
tr: Harika haber! %{confidence} ihtimalle bitkin sağlıklı görünüyor. Herhangi bir hastalık belirtisine rastlamadım, harika bir iş çıkarıyorsun; bakımına aynen devam et!

# farmerErrorBody
source: Oops, something went wrong. Can you try again?
tr: Tüh, bir hata oluştu. Tekrar dener misin?

# lblCamera
source: Camera
tr: Kamera

# lblGallery
source: Gallery
tr: Galeri

# lblSearch
source: Search...
tr: Ara...

# settingsTitle
source: Settings
tr: Ayarlar

# settingsGeneral
source: General
tr: Genel

# settingsTheme
source: Theme
tr: Tema

# settingsLanguage
source: Language
tr: Dil

# settingsAbout
source: About
tr: Hakkında

# settingsVersion
source: Version
tr: Sürüm

# themeSystem
source: System Default
tr: Sistem Varsayılanı

# themeLight
source: Light Mode
tr: Aydınlık Mod

# themeDark
source: Dark Mode
tr: Karanlık Mod

# langEnglish
source: English
tr: İngilizce

# langTurkish
source: Turkish
tr: Türkçe

# historyEmpty
source: No scan history yet.
tr: Henüz geçmiş tarama yok.

# dialogClearTitle
source: Clear History
tr: Geçmişi Temizle

# dialogClearMessage
source: Are you sure you want to delete all scan history? This action cannot be undone.
tr: Tüm tarama geçmişini silmek istediğine emin misin? Bu işlem geri alınamaz.

# actionCancel
source: Cancel
tr: İptal

# actionDelete
source: Delete
tr: Sil

# filterTitle
source: Filter
tr: Filtrele

# filterReset
source: Reset
tr: Sıfırla

# filterApply
source: Apply
tr: Uygula

# filterDate
source: Date Range
tr: Tarih Aralığı

# filterStatus
source: Health Status
tr: Hastalık Durumu

# filterPlants
source: Plant Type
tr: Bitki Türü

# filterAllTime
source: All Time
tr: Tüm Zamanlar

# filterLast15Min
source: Last 15 Min
tr: Son 15 Dakika

# filterLast1Hour
source: Last 1 Hour
tr: Son 1 Saat

# filterLast24Hours
source: Last 24 Hours
tr: Son 24 Saat

# filterLast7Days
source: Last 7 Days
tr: Son 7 Gün

# filterLast30Days
source: Last 30 Days
tr: Son 30 Gün

# filterAllStatus
source: All
tr: Tümü

# filterHealthyOnly
source: Healthy Only
tr: Sadece Sağlıklı

# filterInfectedOnly
source: Infected Only
tr: Sadece Hasta

# btnViewInLibrary
source: View in Library
tr: Kütüphanede İncele

# btnQuestionHow
source: How do you diagnose?
tr: Nasıl teşhis koyuyorsun?

# btnQuestionPlants
source: Which plants?
tr: Hangi bitkilerden anlıyorsun?

# ansQuestionHow
source: I examine the spots and changes on the leaf with an experienced eye. I identify the problem and share the care suggestions needed to revive your plant.
tr: Tecrübeli bir gözle yapraktaki lekeleri ve değişimleri inceliyorum. Sorunu tespit edip, bitkinin tekrar canlanması için gereken bakım önerilerini seninle paylaşıyorum.

# ansQuestionPlants
source: I specialize in the common diseases of 14 plants, such as tomatoes, apples, and grapes. You can see the full list in the Library.
tr: Uzmanlık alanım, bahçelerin vazgeçilmezi olan domates, elma ve üzüm gibi 14 bitkiyi kapsıyor. Tam listeyi senin için Kütüphane bölümünde hazırladım, oradan inceleyebilirsin.

# dsAppleScab
source: Apple: Apple Scab
tr: Elma: Karaleke Hastalığı

# dsAppleBlackRot
source: Apple: Black Rot
tr: Elma: Siyah Çürüklük

# dsAppleCedarRust
source: Apple: Cedar Apple Rust
tr: Elma: Memeli Pas Hastalığı

# dsAppleHealthy
source: Apple: Healthy
tr: Elma: Sağlıklı

# dsBlueberryHealthy
source: Blueberry: Healthy
tr: Yaban Mersini: Sağlıklı

# dsCherryPowderyMildew
source: Cherry: Powdery Mildew
tr: Kiraz: Külleme Hastalığı

# dsCherryHealthy
source: Cherry: Healthy
tr: Kiraz: Sağlıklı

# dsCornCercospora
source: Corn: Cercospora Leaf Spot
tr: Mısır: Cercospora Yaprak Lekesi

# dsCornCommonRust
source: Corn: Common Rust
tr: Mısır: Pas Hastalığı

# dsCornNorthernBlight
source: Corn: Northern Leaf Blight
tr: Mısır: Kuzey Yaprak Yanıklığı

# dsCornHealthy
source: Corn: Healthy
tr: Mısır: Sağlıklı

# dsGrapeBlackRot
source: Grape: Black Rot
tr: Üzüm: Siyah Çürüklük

# dsGrapeEsca
source: Grape: Esca (Black Measles)
tr: Üzüm: Kav Hastalığı (Esca)

# dsGrapeLeafBlight
source: Grape: Leaf Blight (Isariopsis)
tr: Üzüm: Isariopsis Yaprak Yanıklığı

# dsGrapeHealthy
source: Grape: Healthy
tr: Üzüm: Sağlıklı

# dsOrangeHLB
source: Orange: Huanglongbing (Citrus Greening)
tr: Portakal: Turunçgil Yeşillenme Hastalığı

# dsPeachBacterialSpot
source: Peach: Bacterial Spot
tr: Şeftali: Bakteriyel Leke Hastalığı

# dsPeachHealthy
source: Peach: Healthy
tr: Şeftali: Sağlıklı

# dsPepperBacterialSpot
source: Pepper: Bacterial Spot
tr: Biber: Bakteriyel Leke Hastalığı

# dsPepperHealthy
source: Pepper: Healthy
tr: Biber: Sağlıklı

# dsPotatoEarlyBlight
source: Potato: Early Blight
tr: Patates: Erken Yanıklık

# dsPotatoLateBlight
source: Potato: Late Blight
tr: Patates: Geç Yanıklık (Mildiyö)

# dsPotatoHealthy
source: Potato: Healthy
tr: Patates: Sağlıklı

# dsRaspberryHealthy
source: Raspberry: Healthy
tr: Ahududu: Sağlıklı

# dsSoybeanHealthy
source: Soybean: Healthy
tr: Soya Fasulyesi: Sağlıklı

# dsSquashPowderyMildew
source: Squash: Powdery Mildew
tr: Kabak: Külleme Hastalığı

# dsStrawberryLeafScorch
source: Strawberry: Leaf Scorch
tr: Çilek: Yaprak Yanıklığı

# dsStrawberryHealthy
source: Strawberry: Healthy
tr: Çilek: Sağlıklı

# dsTomatoBacterialSpot
source: Tomato: Bacterial Spot
tr: Domates: Bakteriyel Leke Hastalığı

# dsTomatoEarlyBlight
source: Tomato: Early Blight
tr: Domates: Erken Yanıklık

# dsTomatoLateBlight
source: Tomato: Late Blight
tr: Domates: Geç Yanıklık (Mildiyö)

# dsTomatoLeafMold
source: Tomato: Leaf Mold
tr: Domates: Yaprak Küfü

# dsTomatoSeptoria
source: Tomato: Septoria Leaf Spot
tr: Domates: Septorya Yaprak Lekesi

# dsTomatoSpiderMites
source: Tomato: Two-spotted Spider Mite
tr: Domates: İki Noktalı Kırmızı Örümcek

# dsTomatoTargetSpot
source: Tomato: Target Spot
tr: Domates: Hedef Leke Hastalığı

# dsTomatoYellowCurl
source: Tomato: Yellow Leaf Curl Virus
tr: Domates: Sarı Yaprak Kıvırcıklık Virüsü

# dsTomatoMosaic
source: Tomato: Mosaic Virus
tr: Domates: Mozaik Virüsü

# dsTomatoHealthy
source: Tomato: Healthy
tr: Domates: Sağlıklı

# dsUnknown
source: Unknown Condition
tr: Bilinmeyen Durum

# plantApple
source: Apple
tr: Elma

# plantBlueberry
source: Blueberry
tr: Yaban Mersini

# plantCherry
source: Cherry
tr: Kiraz

# plantCorn
source: Corn
tr: Mısır

# plantGrape
source: Grape
tr: Üzüm

# plantOrange
source: Orange
tr: Portakal

# plantPeach
source: Peach
tr: Şeftali

# plantPepper
source: Pepper
tr: Biber

# plantPotato
source: Potato
tr: Patates

# plantRaspberry
source: Raspberry
tr: Ahududu

# plantSoybean
source: Soybean
tr: Soya

# plantSquash
source: Squash
tr: Kabak

# plantStrawberry
source: Strawberry
tr: Çilek

# plantTomato
source: Tomato
tr: Domates

# tabSymptoms
source: Symptoms
tr: Belirtiler

# tabTreatment
source: Treatment
tr: Tedavi

# tabPrevention
source: Prevention
tr: Önlemler

# diseaseInfoPending
source: Disease information is loading...
tr: Hastalık bilgileri yükleniyor...
